app/views/users/show.html.erb

  <strong>Servidores:</strong>
  <% @user.servers.each do |server| %>
---
SELECT "servers".* FROM "servers" INNER JOIN "user_servers" ON "servers"."id" = "user_servers"."server_id" WHERE "user_servers"."user_id" = $1  [["user_id", 1]]


  	<% server.login.each do |login| %>
---
SELECT "logins".* FROM "logins" WHERE "logins"."server_id" = $1  [["server_id", 1]]