app/controllers/logins_controller.rb

  def index
    @logins = Login.all
---
SELECT "logins".* FROM "logins"

  def new
    @login = Login.new
    @servers = Server.all
    @login.user_id = params[:id]
    @user = User.find(@login.user_id)
---
SELECT "servers".* FROM "servers"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @login = Login.new(login_params)

    respond_to do |format|
      if @login.save
---
INSERT INTO "logins" ("login", "senha", "user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["login", "Leo2"], ["senha", "123"], ["user_id", 16], ["server_id", 1], ["created_at", "2017-08-14 19:53:49.569584"], ["updated_at", "2017-08-14 19:53:49.569584"]]

  def destroy
    @login.destroy
---
DELETE FROM "logins" WHERE "logins"."id" = $1  [["id", 980190962]]

    def set_login
      @login = Login.find(params[:id])
---
SELECT  "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]