app/controllers/servers_controller.rb

SELECT "servers".* FROM "servers"
---
  def index
    @servers = Server.all

INSERT INTO "servers" ("login", "created_at", "updated_at", "password_digest", "nome") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @server = Server.new(server_params)

    respond_to do |format|
      if @server.save

DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 980190962]]
---
  def destroy
    @server.destroy

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_server
      @server = Server.find(params[:id])