app/controllers/user_servers_controller.rb

  def index
    @user_servers = UserServer.all
---
SELECT "user_servers".* FROM "user_servers"

  def create
    @user_server = UserServer.new(user_server_params)

    respond_to do |format|
      if @user_server.save
---
INSERT INTO "user_servers" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["server_id", 1], ["created_at", "2017-08-10 20:50:56.056484"], ["updated_at", "2017-08-10 20:50:56.056484"]]

    def set_user_server
      @user_server = UserServer.find(params[:id])
---
SELECT  "user_servers".* FROM "user_servers" WHERE "user_servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]