app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("nome", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Alberto"], ["created_at", "2017-08-10 19:57:39.392816"], ["updated_at", "2017-08-10 19:57:39.392816"], ["password_digest", "$2a$10$HTHxDFMH.80qqm2ydEJa5.owWPlFccMiPHUyazvVUBSuS2BoIxRN."]]